# ColorRangeWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings..::..ColorRangeWidth Property
AnalysisDisplayLegendSettings Class See Also
---
Width of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int ColorRangeWidth { get; set; }
```

Visual Basic
---
```text
Public Property ColorRangeWidth As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ColorRangeWidth {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: colorRangeWidth is greater than 10000 or less than 0 |

# See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace